tutorials/validations/kamkariPCM/constant/PCM/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
type            naturalConvection;

nu		nu [0 2 -1 0 0 0 0]		6.7e-6;

rho		rho [1 -3 0 0 0 0 0]		912;
Cp		Cp [0 2 -2 -1 0 0 0]		2280;
kappa		kappa [ 1 1 -3 -1 0 0 0 ]	0.15;
mu		mu [ 1 -1 -1 0 0 0 0 ]		5.93e-3;
beta            beta [0 0 0 -1 0 0 0]		8e-4;
TRef            TRef [0 0 0 1 0 0 0]		298.15;
Prt		Prt [0 0 0 0 0 0 0]		0.85;

// ************************************************************************* //
