tutorials/validations/kamkariPCM/constant/chamber/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
type            naturalConvection;

nu		nu [0 2 -1 0 0 0 0]		16e-6;

rho		rho [1 -3 0 0 0 0 0]		1.161;
Cp		Cp [0 2 -2 -1 0 0 0]		1007;
kappa		kappa [ 1 1 -3 -1 0 0 0 ]	26.2e-3;
mu		mu [ 1 -1 -1 0 0 0 0 ]		18.57e-6;
beta            beta [0 0 0 -1 0 0 0]		3.34e-3;
TRef            TRef [0 0 0 1 0 0 0]		296;
Prt		Prt [0 0 0 0 0 0 0]		0.85;

// ************************************************************************* //
