tutorials/validations/kamkariPCM/system/chamber/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    U
    {
        internalField   uniform (1.0e-8 0 0);

        boundaryField
        {
            top
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            bottom
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            right
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            left
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            chamber_to_PCM
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        internalField   uniform 298;

        boundaryField
        {
            top
            {
                type            fixedValue;
                value           298;
            }

            bottom
            {
                type            fixedValue;
                value           298;
            }

            right
            {
                type            fixedValue;
                value           298;
            }

            left
            {
                type            fixedValue;
                value           298;
            }

            chamber_to_PCM
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName PCM;
                neighbourPatchName PCM_to_chamber;
                neighbourFieldName T;
                Kappa           kappaEff;
                value           uniform 298;
            }
        }
    }

    p
    {
        internalField   uniform 0;

        boundaryField
        {
            top
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            bottom
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            right
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            left
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            chamber_to_PCM
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }
        }
    }
}


// ************************************************************************* //
